tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "mongodb/brew"
# Core application library for C
brew "glib"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Terminal JSON viewer
brew "fx"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit", link: false
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Fast, highly customisable system info script
brew "neofetch"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-fira-code"
# Tool to measure the computer system's performance
cask "geekbench"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Windows manager and desktop organizer
cask "hazeover"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Sound clear in online meetings
cask "krisp"
# Kubernetes IDE
cask "lens"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Software for Anne Pro and Anne Pro 2
cask "obinskit"
# Zero trust network as a service client
cask "perimeter81"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
# Temporary makeshift alias for the video communication tool Zoom
cask "zoomus"
mas "Adobe Lightroom", id: 1451544217
mas "Flow", id: 1423210932
mas "Trello", id: 1278508951
mas "Unsplash Wallpapers", id: 1284863847
